{
    "web1": 
    {
        "id" : 1,
        "nom" : "Projet : Portfolio Web",
        "annee" : 2021,
        "desc" : "Le projet Porfolio Web est un projet de fin d'études dans lequel nous devions intégrer toutes les connaissances aquises dans le cadre de notre programme dans un site web, plus précisement, notre Portfolio Web. J'ai decidé de le faire à l'aide du cadriciel (framework) React que nous avons appris à utiliser en dernière session.",
        "images" : [
            "PF_001",
            "PF_002",
            "PF_003",
            "PF_004",
            "PF_005",
            "PF_006"
        ],
        "videos" : [],
        "url": "",
        "technos": [
            "React",
            "JavaScript",
            "SASS",
            "HTML"
        ]
    },

    "web2": 
    {
        "id" : 2,
        "nom" : "Projet web : Le Fol Espoir",
        "annee" : 2018,
        "desc" : "Pour le cours de Projet web nous avions la tâche de refaire le site web du département d'arts, lettres et communication - option littérature appelé Le Fol Espoir. À l'aide de mes co-équipières Laurence Dodier, Kathleen Francis et Carolanne, nous avons conçut le site Web en PHP. Le site web a une page d'accueil qui affiche les œuvres plus récents, une page pour tous les projets, une page 'À propos' et une page pour soummettre une nouvelle œuvre. En plus, nous avons aussi fait le côté 'Admin' pour accepter, refuser, modifier, supprimer ou ajouter des nouvelles œuvres. Le design du logo je l'ai fait avec Illustrator.",
        "images" : [
            "FE_001",
            "FE_002",
            "FE_003",
            "FE_004",
            "FE_005",
            "FE_006",
            "FE_007"
        ],
        "videos" : [
        ],
        "url": "",
        "technos": [
            "PHP",
            "CSS",
            "HTML"
        ]
    },

    "web3":
    {
        "id" : 3,
        "nom" : "Exercices React",
        "annee" : 2021,
        "desc" : "Les exercice React sont des travaux de class que nous avons développé pour apprendre à utiliser le cadriciel (framework) React et l'API de Firebase pour le cours de Programmation et Veille technologique. Nous avons utilisé react router pour naviguer dans le site web et firebase pour la base de données.",
        "images" : [
            "photoAVenir"
        ],
        "videos" : [],
        "url": "",
        "technos": [
            "React",
            "Firebase",
            "JavaScript",
            "SASS"
        ]
    }
    ,

    "web4":
    {
        "id" : 4,
        "nom" : "Création Web - Travail Pratique",
        "annee" : 2016,
        "desc" : "Pour la fin de la première session on nous a demandé de faire un site web en HTML et CSS pour évaluer les connaissances apprises dans le cours. Je me suis basé sur un site qui contiendrait l'information de tous les concerts qui se tiendront à Montréal.",
        "images" : [
            "CW_TP_001",
            "CW_TP_002",
            "CW_TP_003",
            "CW_TP_004",
            "CW_TP_005"            
        ],
        "videos" : [],
        "url": "",
        "technos": [
            "HTML",
            "CSS"
        ]
    }
}